import pandas as pd
import pytest


@pytest.fixture
def mock_api_response() -> dict:
    """Фикстура для подмены ответа API"""
    return {"rates": {"USD": 0.01030, "EUR": 0.00952}}


@pytest.fixture
def trans_data() -> dict:
    return {
        "Дата операции": ["01.01.2023 00:00:00", "01.02.2023 00:00:00"],
        "Дата платежа": ["01.01.2023 00:00:00", "01.02.2023 00:00:00"],
        "Номер карты": ["1234", "5678"],
        "Статус": ["завершен", "отменен"],
        "Сумма операции": [100.00, 150.00],
        "Валюта операции": ["RUB", "RUB"],
        "Сумма платежа": [100.00, 150.00],
        "Валюта платежа": ["RUB", "RUB"],
        "Кэшбэк": [1.00, 1.50],
        "Категория": ["продукты", "развлечения"],
        "MCC": [5411, 5813],
        "Описание": ["магазин", "кинотеатр"],
        "Бонусы (включая кэшбэк)": [10.00, 15.00],
        "Округление на инвесткопилку": [0.00, 0.00],
        "Сумма операции с округлением": [100.00, 150.00],
    }


@pytest.fixture
def sample_transactions() -> pd.DataFrame:
    """Фикстура с примером данных транзакций."""
    data = {
        "Дата операции": [
            "01.11.2024 10:15:30",
            "05.11.2024 12:45:00",
            "10.10.2024 14:00:00",
            "30.11.2024 09:30:00",
            "01.12.2024 08:20:15",
        ],
        "Сумма операции": [1000, 500, 200, 300, 400],
        "Валюта": ["RUB", "RUB", "USD", "EUR", "RUB"],
    }
    return pd.DataFrame(data)


@pytest.fixture
def sample_transactions_to_decorator() -> pd.DataFrame:
    data = [
        {"Дата операции": "01.11.2024 10:15:30", "Сумма операции": 1000, "Валюта": "RUB", "Категория": "Супермаркеты"},
        {"Дата операции": "10.10.2024 14:00:00", "Сумма операции": 200, "Валюта": "USD", "Категория": "Супермаркеты"},
        {"Дата операции": "30.11.2024 09:30:00", "Сумма операции": 300, "Валюта": "EUR", "Категория": "Супермаркеты"},
        {"Дата операции": "05.08.2024 08:20:15", "Сумма операции": 400, "Валюта": "RUB", "Категория": "Развлечения"},
    ]
    return pd.DataFrame(data)